# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTableIterator..::..Current Property
ExportPatternTableIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual KeyValuePair<ExportPatternKey, ExportPatternInfo> Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportPatternKey, ExportPatternInfo)
	Get
```

Visual C++
---
```text
public:
virtual property KeyValuePair<ExportPatternKey^, ExportPatternInfo^> Current {
	KeyValuePair<ExportPatternKey^, ExportPatternInfo^> get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
ExportPatternTableIterator Class
Autodesk.Revit.DB Namespace